// #Tính tiền điện

var x = 210,
    total;
if (x <= 50) {
    total = x * 1678;
} else if (50 < x <= 100) {
    total = 1678 * 50 + (x - 50) * 1734;
} else if (100 < x <= 200) {
    total = 1678 * 50 + 50 * 1734 + (x - 100) * 2014;
} else if (200 < x <= 300) {
    total = 1678 * 50 + 50 * 1743 + 100 * 2014 + (x -200) * 2536;
} else if (300 < x <= 400) {
    total = 1678 * 50 + 50 * 1743 + 100 * 2014 + 100 * 2536 + (x - 300) * 2834;
} else {
    (x > 400)
    total = 1678 * 50 + 50 * 1743 + 100 * 2014 + 100 * 2536 + 100 * 2834 + (x - 400) * 2927;
}

document.write(`Tiền điện tháng này : ${total}`);
